[{"title":"Tweedsmuir","content":"Tweedsmuir is the most southern parish in the County of Peebles. It is bordered on three sides by neighbouring counties - the parish of Yarrow in Selkirkshire to the east, Dumfriesshire to the south and Lanarkshire to the west. To the north Tweedsmuir is linked to the rest of Peebleshire by the parish of Drumelzier. Tweedsmuir is situated at the head of Tweeddale, Tweed's Well the source of the River Tweed is at the southern tip of the parish close to the point at which the counties of Peebles, Dumfries and Lanark meet. It is now one of the linked Parishes of Upper Tweeddale.","region":"Peebleshire","d":"M200.24 454.26L194 492.5l10.37 14.03 15.14 4.8 10.23 16.22-.75 11.93-14.48 4.3-9.58 24.27-10.69 17.3-5.78-5.86-14.1 7.98-9.31-2.41-10.58 6.86-3.44-7-12.8-4.77-8.26 8.04-16.36 1-19.94 9.08-4.62-5.85-8.22 4.56-2.24-9.31-9.38 3.39-4.61-5.85-14.87-31.5-9.32-2.4-3.42-8.16 7.19-18.5 3.64-13.9 8.35-17.32 2.45-11.58-5.73-10.5 9.42-8.03 10.55-3.38 39.9-19.33L134 419.94l14.02.14 3.57-6.93 9.36-1.07 27.94 8.41 10.4 11.71z"},{"title":"Drumelzier","content":"Drumelzier stretches across the south of the County of Peebles. It is bordered on the north by the Parish of Stobo, to the east east by the parish of Manor and by the Parish of Yarrow in Selkirkshire, to the south by the Parish of Yarrow and the Parish of Tweedsmuir and by Lanarkshire to the west and the Parish of Broughton, Glenholm and Kilbucho to the north-west. Drumelzier is now one of the linked Parishes of Upper Tweeddale.","region":"Peebleshire","d":"M254.32 301.61l-2.43 9.26-8.26 9.2-19.27 57.84 2.23 10.47 12.73 11.73 1.02 15.1-4.76 9.24-9.44 9.19 1.09 8.13-16.45 9.12-10.54 3.38-.95-22.06-10.4-11.71-27.94-8.41-9.36 1.07-3.57 6.92-14.01-.14-21.24 20.68-39.9 19.33-10.55 3.37 1.4-23.2 8.25-6.88 11.72-4.52 7.05-3.41 4.74-6.92 18.95-26.5 8.22-4.56 4.74-6.92 20.99 3.7 13.04-19.6 4.81-13.88-4.48-18.61 14.17-16.11 1.3-12.75 11.75-6.85 18.68.19 10.47 4.75 16.5-14.93z"},{"title":"Broughton, Glenholm Kilbucho","content":"The combined parishes of Broughton, Glenhom Kilbucho are on the western border of Peeblesshire. Glenholm, Kilbucho Broughton were combined in 1794 and in 1803 a new church was built at Calzeat. They are now one of the linked Parishes of Upper Tweeddale. Glenhom and Kilbucho are bounded by Lanarkshire but Skirling is interposed between Broughton and Lanarkshire. Kirkurd is to the north with Stobo and Drumelzier to the east. John Buchan the author had strong family ties with Broughton and the village houses the John Buchan Centre. The village war memorial is beside the main road.","region":"Peebleshire","d":"M162.82 224.08l5.77 7.03-1.3 13.91 12.7 15.22-3.76 24.33-17.65 13.75 9.27 7.06 9.37-2.23-1.3 12.76-14.18 16.1 4.49 18.62-4.81 13.88-13.05 19.6-20.98-3.7-4.74 6.92-8.22 4.56-18.96 26.5-4.74 6.92-7.04 3.4-6.9-10.5-6.66-34.9 9.55-20.79-13.8-21.03-3.31-19.76-11.55-12.89.22-22.05 25.75-5.54 11.71-3.36 31.52 1.47 1.36-18.55-2.18-16.27 10.6-8.02.13-13.92z"},{"title":"Skirling","content":"Skirling is a small parish on the western edge of the County of Peebles and it is now one of the linked Parishes of Upper Tweeddale. Kirkurd Parish is to the north east and the combined parish of Broughton, Glenholm Kilbucho is to the east south. Lanarkshire lies to the west of Skirling.","region":"Peebleshire","d":"M130.13 222.6l-.13 13.92-10.6 8.02 2.18 16.27-1.36 18.55-31.52-1.47 3.73-22.02-9.31-3.57 3.71-20.86L97.5 215.3l11.73-4.52 3.62-11.57 8.2-3.4-.17 17.4z"},{"title":"Kirkurd","content":"Kirkurd is a rural parish on the western boundary of the County of Peebles. It is bounded on the north by West Linton and Newlands with Stobo to the east and Broughton Skirling to the south. The original parish church is a ruin within the policies of Castlecraig. The current building was erected in 1766. The parish war memorial is a conical stone structure outside the village near the A701. The parishes of Kirkurd and Newlands have been combined and this new parish is linked with West Linton","region":"Peebleshire","d":"M173.89 168.49l11.64 3.6 10.33 18.67L211 194.4l-7.22 21.98-8.32 13.84-30.22-14.23-2.42 8.1-32.69-1.5-9.25-9.37.17-17.4 36.61-40.26 4.54 13.97z"},{"title":"Manor","content":"Manor Parish - sometimes referred to as Kirkton Manor - is situated in the County of Peebles being bounded on the north and east by the parish of Peebles, on the south by the Selkirkshire Parish of Yarrow and on the west by the Parish of Drumelzier and on the north-west by the Parish of Stobo. The parish is located along the valley of Manor Water, a tributary of the River Tweed and is now part of the combined parish of Lyne Manor despite the absence of a common boundary. Much of the original parish is upland moor.","region":"Peebleshire","d":"M291.07 247.43l10.48 2.42 5.91-6.9 5.76 8.18 5.76 8.18-25.86 16 2.27 6.98 18.74-5.61 4.57 10.49 13.84 17.55-3.58 8.08 6.94 7.04-10.68 16.14 4.44 23.26-11.8 11.48-9.37 3.4-8.26 8.03-1.33 16.24-23.54 18.33-7.16 15.02-8.2 3.4-19.66-19.93-1.02-15.1-12.73-11.74-2.23-10.46 19.26-57.84 8.27-9.2 2.43-9.26 14.21-19.6 1.35-18.55-7.99-18.65 7.08-6.89 10.52-1.05 9.32 2.41z"},{"title":"Stobo","content":"Stobo, in the County of Peebles lies south west of the county town. It is bounded on the north by Kirkurd, Newlands and Lyne. On the west are Peebles and Manor, whilst Drumelzier is to the south and Broughton is on the east. The village is predominately of 19th century origon and straggles along the B712. The church is the most complete and impressive Romanesque parish church in the Borders. Stobo is now one of the linked Parishes of Upper Tweeddale.","region":"Peebleshire","d":"M229.62 201.54l4.52 15.14 15.12 7.11-1.26 9.28 14.03-2.18 17.46 5.98-10.52 1.05-7.07 6.9 7.99 18.64-1.36 18.56-14.21 19.59-19.7-15.3-16.5 14.93-10.47-4.75-18.69-.19-11.74 6.85-9.37 2.23-9.27-7.06 17.65-13.75 3.75-24.34-12.7-15.21 1.31-13.92-5.77-7.02 2.42-8.1 30.23 14.23 8.31-13.84 7.23-21.98z"},{"title":"Newlands","content":"Newlands parish is in the north of Peeblesshire on the border with Midlothian. It is bounded on the east by Eddleston. Kirkurd, Stobo and Lyne are to to the south and West Linton to the west. The church is on the banks of Lyne Water with few houses in the immeidiate vicinity. The present building was erected in 1838. The ruins of the original Saxon Gothic church are close by. The parish war memorial is on the wall of the church. Drochil Castle, which dates from the late 16th century stands above the junction of Lyne Water and Tarth Water. The parishes of Newlands and Kirkurd have been combined and this new parish is linked with West Linton","region":"Peebleshire","d":"M250.94 171.58l-11.75 6.85 4.6 7.01-3.66 16.21-10.51-.1-18.62-7.16-15.14-3.63-10.33-18.67-11.64-3.6 11.78-10.33 12.96-11.48-9.17-17.5.15-15.08 9.23 11.7 14 2.46 5.9-5.75-2.2-15.1-1.1-6.98 2.42-8.1 8.26-8.04 23.54-18.33 3.59-8.1 12.97-12.63 22.3-10.22 12.8 3.61 14.1-7.98-11.84 16.13 5.77 7.02-11.88 20.77-13.07 21.92-20.04 18.37 2.22 11.63-7.22 20.82-8.25 8.04z"},{"title":"Eddleston","content":"Eddleston is in the north of Peeblesshire with Midlothian to north and east. Innerleithen abuts at the south east corner, Peebles and Lyne are on the south and Newlands is to the west. The parish is in a broad valley through which Eddleston Water runs and which provided the route for both the road and the railway from Edinburgh to Peebles. There has been a church here since the 12th century but the current building dates from the 18th century. The parish is now linked with the Old Parish Church in Peebles. During World War II Polish soldiers were billeted in the area and they constructed a relief map of Scotland in a pond in the grounds of Black Barony Castle, now a hotel and the Scottish Ambulance Services training centre.","region":"Peebleshire","d":"M350.44 33.32l8.13 4.72-5.96 11.55L369.97 66 364 79.88 379 97.44l-4.91 24.32-4.82 13.88-.13 13.93 2.22 11.63-36.3 8.92-27.05 18.3-15.15-3.64-7.13 12.7-26.71-15.36-8.07-10.53.16-16.25 8.26-8.04 7.21-20.82-2.22-11.63L284.4 96.5l13.07-21.92 11.89-20.78-5.77-7.02 11.84-16.13 20.12-26.49 9.33 1.26-1.27 10.43-.1 9.28z"},{"title":"Traquair","content":"Traquair Parish is situated in the west of Peeblesshire being bounded on the north by the Parish of Innerleithen, on the east and south by the Parish of Yarrow in Selkirkshire and on the west by the Parish of Peebles. In 2000 it became part of the Parish of Innerleithen, Traquair and Walkerburn.","region":"Peebleshire","d":"M378.64 250.64l17.5 1.33 15.27-7.97 4.57 9.33-3.66 16.22 32.47 23.54 16.52-17.25 16.39-3.31 8.12 4.72 28.13-9 3.18 18.18 7 14.42-9.48 13.83-6 16.19-24.48-4.89-.2 19.73-8.27 9.2-11.64-3.6-11.78 10.33-8.1-8.2.21-20.9-9.23-11.7-9.52 18.48-7.35 33.58 2.18 16.27-21.03-.2-15.1-8.29-18.65-3.67-5.76-8.18-9.27-7.06-9.21-12.86 9.38-4.54 8.24-5.72 9.45-10.35-1.05-12.78 7.17-16.18 1.25-8.1-13.77-24.52.22-22.05z"},{"title":"Lyne & Meggett","content":"Lyne is a small parish in the County of Peebles lying just to the west of the county town. It is bounded on the north by Eddleston with Peebles to the east, Stobo to the south and Newlands on the west. Lyne Water runs through the parish and the main settlement is around the disused station on the former Caledonian Railway line to Peebles. The church is about a mile away on a slight rise to the north of the A72. There are the remains of a Roman Fort near Lyne Water. Meggett is united with Lyne, although they have no common border. They now form part of the combined parish of Lyne & Manor although yet again the two parishes don't share a boundary.","region":"Peebleshire","d":"M285.98 197.53l-6.25 39.52-17.52-6-14.08 2.19 1.27-9.3-15.16-7.14-4.53-15.18 10.54.11 3.68-16.26-4.62-7.03 11.78-6.87 8.1 10.56z"},{"title":"Peebles","content":"The parish of Peebles lies in the eastern half of the county of the same name. Eddleston is on the northern boundary with Innerleithen and Traquair to the east. The southern tip borders onto Selkirkshire parish of Yarrow with Lyne, Stobo and Manor on the wast. The town originated at the pont where Eddleston Water enters the Tweed. John Buchan the author and William Chambers, the publisher and orignator of Chambers dictionary were both born in Peebles. There are now two parishes in Peebles - the Old Parish Church (to which Eddleston is now linked) and St Andrews Leckie","region":"Peebleshire","d":"M386.3 185.72l6.6 40.69-5.9 5.74-5.92 8.06-2.44 10.42-16.3-5.96-.21 22.05 13.77 24.5-1.25 8.12-7.17 16.18 1.04 12.77-9.45 10.35-8.23 5.72-9.4 4.55-11.78 10.33-4.44-23.26 10.68-16.14-6.94-7.03 3.58-8.1-13.84-17.54-4.56-10.5-18.75 5.62-2.26-6.99 25.85-15.98-5.76-8.19-5.75-8.18-5.91 6.9-10.5-2.42-2.25-8.15-9.31-2.41 6.23-39.4 7.13-12.7 15.15 3.64 27.05-18.3 36.3-8.92 6.86 14z"},{"title":"Innerleithen","content":"Innerleithen Parish is situated in the County of Peebles being bounded on the north by the County of Midlothian and the Parish of Stow, on the east by the Parish of Caddonfoot, on the south by the Parish of and Traquair and on the west by the Parishes of Peebles and Eddleston. Robert Smail's Printing Works is located in Innerleithen High Street. This preserved Victorian business includes a significant archive of business and private papers, including the records of a shipping agency run by RC Smail at the beginning of the 20th century. The town war memorial is the gardens in front of the former Burgh Chambers.","region":"Peebleshire","d":"M389.07 141.64l9.39-4.54 24.61-9.04 17.5 2.5 11.56 11.72 11.63 4.76 12.82 3.6 12.7 15.23 10.99 12.57-.13 12.77 11.95 7.1 5.84 8.04 6.06 10.22-4.16 12.6 20.2 19.94-.46 13.17 27.26 13.58.88 8.76-23.57 1.34-6.96-4.71-4.6-8.17-18.63-4.83-28.13 9-8.12-4.73-16.39 3.32-16.52 17.24-32.47-23.54 3.66-16.2-4.57-9.34-15.27 7.97-17.5-1.34 2.43-10.42 5.93-8.06 5.9-5.74-6.6-40.7-8.08-10.52-6.87-14-2.22-11.63.14-13.92 4.81-13.88 9.29 5.9z"}]
